/* =========================================================
   constants/locations.js — стандартный пак локаций
========================================================= */
// @ts-nocheck
"use strict";

export const DEFAULT_LOCATIONS = [
  {
    name: "Орбитальная станция",
    roles: [
      "Космонавт",
      "Врач",
      "Бортинженер",
      "Инопланетный биолог",
      "Капитан",
      "Навигатор",
      "Связист"
    ]
  },
  {
    name: "Подводная лодка",
    roles: [
      "Капитан",
      "Акустик",
      "Торпедист",
      "Кок",
      "Матрос",
      "Механик",
      "Радист"
    ]
  },
  {
    name: "Пиратский корабль",
    roles: [
      "Капитан пиратов",
      "Штурман",
      "Кок",
      "Канонир",
      "Юнга",
      "Квартирмейстер",
      "Пленный дворянин"
    ]
  },
  {
    name: "Голливудская студия",
    roles: [
      "Режиссёр",
      "Актёр",
      "Оператор",
      "Гримёр",
      "Продюсер",
      "Каскадёр",
      "Сценарист"
    ]
  },
  {
    name: "Психиатрическая больница",
    roles: [
      "Главный врач",
      "Пациент",
      "Медсестра",
      "Санитар",
      "Психолог",
      "Охранник",
      "Посетитель"
    ]
  },
  {
    name: "Секретная лаборатория",
    roles: [
      "Учёный",
      "Лаборант",
      "Охранник",
      "Инженер",
      "Директор",
      "Инспектор",
      "Испытуемый"
    ]
  }
];
